<a href="https://colab.research.google.com/github/Mai-Binh-Nam/Hand-on_DataAnalysisVEF/blob/master/%5BStudents%5D_Lecture_01_Types_of_join.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Analysis Course - VEF Academy 
## Introduction to Data Analysis

### Popular libraries in Python
1. Numpy for numerical calculation. You can read more [here](https://towardsdatascience.com/the-ultimate-beginners-guide-to-numpy-f5a2f99aef54).
1. Pandas used very often for data analysis. It provides data structures and operations suitable for analyzing tabular data and time series data.
1. Matplotlib for visualizing data. An (higher level) alternative is Plotly.

## Import necessary libraries

In [ ]:
import numpy as np
import pandas as pd
import datetime as dt

## A worked example of joining tables in Python

In [ ]:
candidates = pd.DataFrame(data = {"candidate_name": ["Mr A", "Ms B", "Ms C", "Mr D"], 
                               "age": [31, 22, 27, 45],
                               "position": ["Accountant", "Marketing", "Trainer", "Sales"]}
                       )

jobs = pd.DataFrame(data = {"company": ["ACB", "VinID", "California", "VJC", "LG"],
                               "position": ["Accountant", "Sales", "Trainer", "Operation", "Engineer"]})

In [ ]:
candidates

  candidate_name  age    position
0           Mr A   31  Accountant
1           Ms B   22   Marketing
2           Ms C   27     Trainer
3           Mr D   45       Sales

In [ ]:
jobs

      company    position
0         ACB  Accountant
1       VinID       Sales
2  California     Trainer
3         VJC   Operation
4          LG    Engineer

Assume you're the admin of the recruitment agency and you need to arrange meetings when there are matches between candidates and job openings. You will be likely interested in knowing only the matches.

In [ ]:
# Admin
# Inner join
pd.merge(candidates, jobs, on="position", how="inner")

  candidate_name  age    position     company
0           Mr A   31  Accountant         ACB
1           Ms C   27     Trainer  California
2           Mr D   45       Sales       VinID

In [ ]:

# Left join
pd.merge(candidates, jobs, on="position", how="left")

  candidate_name  age    position     company
0           Mr A   31  Accountant         ACB
1           Ms B   22   Marketing         NaN
2           Ms C   27     Trainer  California
3           Mr D   45       Sales       VinID

In [ ]:

# Right join
pd.merge(candidates, jobs, on="position", how="right")

  candidate_name   age    position     company
0           Mr A  31.0  Accountant         ACB
1           Ms C  27.0     Trainer  California
2           Mr D  45.0       Sales       VinID
3            NaN   NaN   Operation         VJC
4            NaN   NaN    Engineer          LG

### One-to-many join

In [ ]:
candidates = pd.DataFrame(data = {"candidate_name": ["Mr A", "Ms B", "Ms C", "Mr D"], 
                               "age": [31, 22, 27, 45],
                               "position": ["Accountant", "Marketing", "Trainer", "Sales"]}
                       )

jobs = pd.DataFrame(data = {"company": ["ACB", "ACB", "VinID", "Masan", "Masan", "California", "VJC", "LG", "LG"],
                               "position": ["Accountant", "Marketing", "Sales", "Data Analyst", "Marketing", "Trainer", "Operation", "Engineer", "Sales"]})

In [ ]:
# Full join
pd.merge(candidates, jobs, on="position", how="outer", indicator=True)

  candidate_name   age      position     company      _merge
0           Mr A  31.0    Accountant         ACB        both
1           Ms B  22.0     Marketing         ACB        both
2           Ms B  22.0     Marketing       Masan        both
3           Ms C  27.0       Trainer  California        both
4           Mr D  45.0         Sales       VinID        both
5           Mr D  45.0         Sales          LG        both
6            NaN   NaN  Data Analyst       Masan  right_only
7            NaN   NaN     Operation         VJC  right_only
8            NaN   NaN      Engineer          LG  right_only

### Many-to-many join

In [ ]:
candidates = pd.DataFrame(data = {"candidate_name": ["Mr A", "Ms B", "Ms C", "Mr D", "Mr A", "Ms E", "Dr G"], 
                               "age": [31, 22, 27, 45, 31, 21, 35],
                               "position": ["Accountant", "Marketing", "Trainer", "Sales", "Data Analyst", "Marketing", "Sales"]}
                       )

jobs = pd.DataFrame(data = {"company": ["ACB", "ACB", "VinID", "Masan", "Masan", "California", "VJC", "LG", "LG"],
                               "position": ["Accountant", "Marketing", "Sales", "Data Analyst", "Marketing", "Trainer", "Operation", "Engineer", "Sales"]})

In [ ]:
# Full join
pd.merge(candidates, jobs, on="position", how="outer")

  candidate_name   age    position     company
0           Mr A  31.0  Accountant         ACB
1           Ms B  22.0   Marketing         NaN
2           Ms C  27.0     Trainer  California
3           Mr D  45.0       Sales       VinID
4            NaN   NaN   Operation         VJC
5            NaN   NaN    Engineer          LG

In [ ]:
# Full join
pd.merge(candidates, jobs, on="position", how="outer", indicator=True).sort_values("company")

   candidate_name   age      position     company      _merge
0            Mr A  31.0    Accountant         ACB        both
1            Ms B  22.0     Marketing         ACB        both
3            Ms E  21.0     Marketing         ACB        both
5            Ms C  27.0       Trainer  California        both
7            Mr D  45.0         Sales          LG        both
9            Dr G  35.0         Sales          LG        both
12            NaN   NaN      Engineer          LG  right_only
2            Ms B  22.0     Marketing       Masan        both
4            Ms E  21.0     Marketing       Masan        both
10           Mr A  31.0  Data Analyst       Masan        both
11            NaN   NaN     Operation         VJC  right_only
6            Mr D  45.0         Sales       VinID        both
8            Dr G  35.0         Sales       VinID        both

## Try joining the orders and the order_items datasets together using 4 different types of join we have covered. How many rows do we have in the result table for each type of join?

### Joining using merge function of pandas library

In [ ]:
full_join = pd.merge(orders, order_items, on="order_id", how="outer")
print(full_join.shape)

(113425, 14)

In [ ]:
left_join = pd.merge(orders, order_items, on="order_id", how="left")
print(left_join.shape)

(113425, 14)

In [ ]:
right_join = pd.merge(orders, order_items, on="order_id", how="right")
print(right_join.shape)

(112650, 14)

In [ ]:
inner_join = pd.merge(orders, order_items, left_on="order_id", right_on="order_id", how="inner")
print(inner_join.shape)

(112650, 14)

### Joining using join function of pandas

In [ ]:
# Full join

full_join = orders.join(order_items.set_index("order_id"), on="order_id", how="outer")
print(full_join.shape)

(113425, 14)

In [ ]:
# Left join

left_join = orders.join(order_items.set_index("order_id"), on="order_id", how="left")
print(left_join.shape)

(113425, 14)

In [ ]:
# Right join

right_join = orders.join(order_items.set_index("order_id"), on="order_id", how="right")
print(right_join.shape)

(112650, 14)

In [ ]:
# Inner join

inner_join = orders.join(order_items.set_index("order_id"), on="order_id", how="inner")
print(inner_join.shape)

(112650, 14)

### References:
1. Comparison between join and merge: https://pandas.pydata.org/docs/user_guide/merging.html
1. Examples of using merge with additional parameters: https://www.analyticsvidhya.com/blog/2020/02/joins-in-pandas-master-the-different-types-of-joins-in-python/